array = [621, 445, 147, 159, 430, 222, 482, 44, 194, 522,
         652, 494, 14, 126, 532, 387, 441, 471, 337, 446,
         18, 36, 202, 574, 556, 458, 16, 139, 222, 220,
         107, 82, 264, 366, 501, 319, 314, 430, 55, 336]

p 'узнать количество элементов в массиве'
p array.count
p '-------------------------------------------------------------------------------------------------------------'

p 'перевернуть массив'
p array.reverse
p '-------------------------------------------------------------------------------------------------------------'

p 'найти наибольшее число'
p array.max
p '-------------------------------------------------------------------------------------------------------------'

p 'найти наименьшее число'
p array.min
p '-------------------------------------------------------------------------------------------------------------'

p 'отсортировать от меньшего к большему'
p array.sort
p '-------------------------------------------------------------------------------------------------------------'

p 'отсортировать от большего к меньшему'
p array.sort.reverse
p '-------------------------------------------------------------------------------------------------------------'

p 'оставить только те числа, которые без остатка делятся на 3'
p array.select { |e| e % 3 == 0 }
p '-------------------------------------------------------------------------------------------------------------'

p 'удалить из массива числа, которые повторяются (то есть, нужно вывести массив, в котором нет повторов)'
p array.uniq
p '-------------------------------------------------------------------------------------------------------------'

p 'разделить каждый элемент на 10, в результате элементы не должны быть округлены до целого'
p array.map { |e| e / 10 }
p '-------------------------------------------------------------------------------------------------------------'

p 'поменять местами минимальный и максимальный элементы массива'
p "Max: #{array.index(array.max)} Min: #{array.index(array.min)}"
tmp = array.min
array[array.index(array.min)] = array.max
array[array.index(array.max)] = tmp
p "Max: #{array.index(array.max)} Min: #{array.index(array.min)}"
p '-------------------------------------------------------------------------------------------------------------'

p 'найти элементы, которые находятся перед минимальным числом в массиве'
p array[0...(array.index(array.min))]
p '-------------------------------------------------------------------------------------------------------------'

p 'получить новый массив, который содержит буквы английского алфавита, порядковый номер которых есть в нашем массиве'
letters = []
indexes = array.select { |e| e.positive? && e <= 25 }
indexes.each { |i| letters << ('a'..'z').to_a[i] }
p letters
p '-------------------------------------------------------------------------------------------------------------'

p 'необходимо найти три наименьших элемента'
three_min = []
3.times { three_min << array.delete(array.min) }
p three_min
p '-------------------------------------------------------------------------------------------------------------'

p 'удалить все нечетные числа'
p array.each { |e| array.delete(e) if e.odd? }
p '-------------------------------------------------------------------------------------------------------------'
